//задание2-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//using System;

//class Program
//{
//    static void Main(string[] args)
//    {
//        Console.WriteLine("Введите число:");
//        int number = int.Parse(Console.ReadLine());

//        if (number % 3 == 0)
//        {
//            Console.WriteLine("Число делится на 3");
//        }
//        else
//        {
//            Console.WriteLine("Число не делится на 3");
//        }
//    }
//}
//задание3-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//using System;

//class Program
//{
//    static void Main(string[] args)
//    {
//        Console.WriteLine("Введите число:");
//        int number = int.Parse(Console.ReadLine());

//        if (number % 5 == 2 && number % 7 == 1)
//        {
//            Console.WriteLine("Число удовлетворяет критериям");
//        }
//        else
//        {
//            Console.WriteLine("Число не удовлетворяет критериям");
//        }

//    }
//}
//задание4-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//using System;

//class Program
//{
//    static void Main(string[] args)
//    {
//        Console.WriteLine("Введите число:");
//        int number = int.Parse(Console.ReadLine());

//        if (number % 4 == 0 && number >= 10)
//        {
//            Console.WriteLine("Число удовлетворяет критериям");
//        }
//        else
//        {
//            Console.WriteLine("Число не удовлетворяет критериям");
//        }
//    }
//}
//задание5--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//using System;

//class Program
//{
//    static void Main(string[] args)
//    {
//        Console.WriteLine("Введите число:");
//        int number = int.Parse(Console.ReadLine());

//        if (number >= 5 && number <= 10)
//        {
//            Console.WriteLine("Число попадает в диапазон от 5 до 10");
//        }
//        else
//        {
//            Console.WriteLine("Число не попадает в диапазон от 5 до 10");
//        }
//    }
//}
//задание6--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//using System;

//class Program
//{
//    static void Main(string[] args)
//    {
//        Console.WriteLine("Введите число:");
//        int number = int.Parse(Console.ReadLine());

//        int fourthDigitFromRight = (number / 1000) % 10;

//        Console.WriteLine("Четвертая цифра справа: " + fourthDigitFromRight);
//    }
//}
//задание7--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//using System;

//class Program
//{
//    static void Main(string[] args)
//    {
//        Console.Write("Введите число: ");
//        int number = int.Parse(Console.ReadLine());
//        char digit = Convert.ToString(number, 8)[^2];

//        Console.WriteLine($"Вторая справа цифра: {digit}");
//    }
//}
//задание8--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//using System;

//class Program
//{
//    static void Main(string[] args)
//    {
//        Console.Write("Введите число: ");
//        int number = int.Parse(Console.ReadLine());

//        int thirdBit = (number >> 2) & 1;

//        Console.WriteLine($"Третий бит справа: {thirdBit}");
//    }
//}
//задание9--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//using System;

//class Program
//{
//    static void Main(string[] args)
//    {
//        Console.Write("Введите число: ");
//        int number = int.Parse(Console.ReadLine());
//        int mask = 1 << 2;
//        int result = number | mask;
//        Console.WriteLine($"Число после установки третьего бита: {result}");
//    }
//}
//задание10-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//class Program
//{
//    static void Main()
//    {
//        Console.Write("Введите число в бинарном представлении: "); 
//        string num = Console.ReadLine();
//        if (IsBinaryString(num))
//        {
//            int num1 = Convert.ToInt32(num, 2); 
//            // Установка четвертого бита равным нулю 
//            int num2 = ~(1 << 3); int num3 = num1 & num2;
//            // Вывод результата 
//            Console.WriteLine($"Результат после установки четвертого бита в ноль: {Convert.ToString(num3, 2)}"); 
//            Console.ReadLine();
//        }
//        else
//        {
//            Console.WriteLine("Введенное значение не является корректным бинарным числом.");
//            Console.ReadLine();
//        }
//    } 
//     static bool IsBinaryString(string input) 
//    {        foreach (char c in input) 
//        {            if (c != '0' && c != '1') 
//            {                return false; 
//            }        }
//return true;    } 
//} 
//задание11-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//class Program
//{
//    static void Main()
//    {
//        // Ввод числа в бинарном представлении от пользователя
//        Console.Write("Введите число в бинарном представлении: "); 
//        string num = Console.ReadLine(); if (IsBinaryString(num))
//        {            // Преобразование введенной строки в бинарное число 
//            int num1 = Convert.ToInt32(num, 2);
//            // Меняем значение второго бита на противоположное
//            int num2 = num1 ^ (1 << 1); 
//            // Вывод результата 
//            Console.WriteLine($"Результат после изменения второго бита: {Convert.ToString(num2, 2)}"); Console.ReadLine();
//        }
//        else
//        {
//            Console.WriteLine("Введенное значение не является корректным бинарным числом.");
//            Console.ReadLine();
//        }
//    } 
//    // Функция для проверки корректности введенной строки на представление бинарного числа
//    static bool IsBinaryString(string input) 
//    {        foreach (char c in input) 
//        {            if (c != '0' && c != '1') 
//            {               
//                return false; 
//            }
//        }
//                return true;    
//    } 
//} 